same with aws_security_group. How is this issue still open after 2 years?!? 

initial plan and error output. this is a completely isolated security group with no attachments other than a vpc

```
Terraform will perform the following actions:

  # module.network.module.security_groups.aws_security_group.some-random-test will be destroyed
  # (because aws_security_group.some-random-test is not in configuration)
  - resource "aws_security_group" "some-random-test" {
      - arn                    = "arn:aws:ec2:us-east-2:XXX:security-group/sg-XXX" -> null
      - description            = "devopstest-delete-me" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-XXX" -> null
      - ingress                = [] -> null
      - name                   = "devopstest-delete-me" -> null
      - owner_id               = "XXX" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "devopstest-delete-me"
        } -> null
      - tags_all               = {
          - "Name" = "devopstest-delete-me"
        } -> null
      - vpc_id                 = "vpc-XXX" -> null
    }

  # module.network.module.security_groups.aws_security_group.some_random_test will be created
  + resource "aws_security_group" "some_random_test" {
      + arn                    = (known after apply)
      + description            = "devopstest-delete-me"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "devopstest-delete-me"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "devopstest-delete-me"
        }
      + tags_all               = {
          + "Name" = "devopstest-delete-me"
        }
      + vpc_id                 = "vpc-XXX"
    }

```


```
Error: error creating Security Group (devopstest-delete-me): InvalidGroup.Duplicate: The security group 'devopstest-delete-me' already exists for VPC 'vpc-XXX'
│ 	status code: 400, request id: 4e2dd82b-ca0a-41c2-a6c8-5a1f05633d9c
│
│   with module.network.module.security_groups.aws_security_group.some_random_test,
│   on ../../sg/main.tf line 6, in resource "aws_security_group" "some_random_test":
│    6: resource "aws_security_group" "some_random_test" {
```

rerun plan and it works

```
module.network.module.vpc.aws_vpc.management-vpc: Refreshing state... [id=vpc-0c50da665b47fde40]
module.network.module.vpc.aws_vpc.environment-vpc: Refreshing state... [id=vpc-0294946fcb44cdc21]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.module.security_groups.aws_security_group.some-random-test will be created
  + resource "aws_security_group" "some-random-test" {
      + arn                    = (known after apply)
      + description            = "devopstest-delete-me"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "devopstest-delete-me"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "devopstest-delete-me"
        }
      + tags_all               = {
          + "Name" = "devopstest-delete-me"
        }
      + vpc_id                 = "vpc-XXX"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
module.network.module.security_groups.aws_security_group.some-random-test: Creating...
module.network.module.security_groups.aws_security_group.some-random-test: Creation complete after 2s [id=sg-0e96e23ea888ddfe4]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:
```